---
kind: method
id: M:Autodesk.Revit.Creation.AreaCreationData.#ctor(Autodesk.Revit.DB.ViewPlan,Autodesk.Revit.DB.UV)
source: html/9b9aa480-b15c-880e-da2e-6f04f3f6c6ff.htm
---
# Autodesk.Revit.Creation.AreaCreationData.#ctor Method

The data needed to create a new area

## Syntax (C#)
```csharp
public AreaCreationData(
	ViewPlan areaView,
	UV point
)
```

## Parameters
- **areaView** (`Autodesk.Revit.DB.ViewPlan`) - The view of area element.
- **point** (`Autodesk.Revit.DB.UV`) - The point which lies in the enclosed region of AreaBoundaryLines to put the new created Area